{
  "dataType": "XBR",
  "name": "External Reference",
  "description": "The XBR data type is used to represent references to external systems, documents, or data sources that are related to but not contained within the current HL7 message. It provides structured information for linking to external resources such as images, documents, web services, or other healthcare information systems. XBR enables healthcare applications to maintain connections to distributed information while preserving message integrity and supporting complex healthcare information architectures.",
  "standard": "hl7v23",
  "version": "2.3",
  "category": "composite",
  "components": {
    "XBR.1": {
      "name": "External Reference Type",
      "dataType": "ID",
      "description": "Specifies the type of external reference (e.g., URL, FILE, DATABASE, SYSTEM). Indicates the nature and access method for the external resource.",
      "length": 20,
      "usage": "optional",
      "position": 1,
      "table": "0498"
    },
    "XBR.2": {
      "name": "External Reference Identifier",
      "dataType": "ST",
      "description": "The unique identifier or locator for the external resource (e.g., URL, file path, database key). Provides the specific reference needed to access the external information.",
      "length": 999,
      "usage": "optional",
      "position": 2
    },
    "XBR.3": {
      "name": "External Reference Version ID",
      "dataType": "ST",
      "description": "Version identifier for the external resource to ensure reference accuracy over time. Supports versioning of external documents and data sources.",
      "length": 199,
      "usage": "optional",
      "position": 3
    },
    "XBR.4": {
      "name": "External Reference Description",
      "dataType": "ST",
      "description": "Human-readable description of the external resource content or purpose. Provides context for understanding the nature and relevance of the external reference.",
      "length": 199,
      "usage": "optional",
      "position": 4
    }
  },
  "length": 1417,
  "constraints": {
    "encoding": "Components separated by ^ (component separator)",
    "referenceType": "External reference type should reference valid values from table 0498",
    "identifierValidation": "External reference identifier should be valid for the specified reference type",
    "accessibility": "External references should be accessible to authorized systems and users",
    "versionControl": "Version IDs should accurately reflect the referenced resource version"
  },
  "usage": [
    "Links to external medical images and diagnostic studies",
    "References to electronic documents and clinical reports",
    "Connections to laboratory information systems and results",
    "Links to external clinical decision support systems",
    "References to patient portal and health information exchange data",
    "Connections to medical device data and monitoring systems"
  ],
  "examples": [
    "URL^https://pacs.hospital.org/study/12345^v2.1^Chest X-Ray Study",
    "FILE^/shared/documents/discharge_summary_20240315.pdf^1.0^Discharge Summary",
    "DATABASE^LABSYS:RESULT:789456123^2024.1^Complete Blood Count Results",
    "SYSTEM^HIE:PATIENT:MRN123456^current^Health Information Exchange Record",
    "URL^https://api.pharmacy.com/rx/prescription/98765^3.2^Prescription Information",
    "FILE^\\\\server\\imaging\\CT_20240315_001.dcm^1.0^CT Scan - Abdomen"
  ],
  "commonFields": [
    "External document references in clinical documentation",
    "Links to diagnostic imaging studies and reports",
    "References to laboratory systems and result databases",
    "Connections to patient portal and health information exchanges",
    "Links to medical device data and monitoring systems",
    "References to clinical decision support and knowledge systems"
  ],
  "generationHints": {
    "typical": "Use realistic external reference types and identifiers for healthcare systems",
    "referenceTypes": ["URL", "FILE", "DATABASE", "SYSTEM", "API", "SERVICE"],
    "identifiers": "Use appropriate URL, file path, or system identifier formats",
    "versions": "Include version numbers that would be realistic for healthcare systems",
    "descriptions": "Provide meaningful descriptions that explain the external resource content"
  },
  "relatedDataTypes": {
    "ST": "String - used for identifier, version, and description components",
    "ID": "Coded Value - used for external reference type component",
    "ED": "Encapsulated Data - alternative for embedded external content",
    "RP": "Reference Pointer - related reference data type",
    "HD": "Hierarchic Designator - may be used for system identification"
  },
  "implementationNotes": {
    "accessibility": "Ensure external references are accessible to authorized users and systems",
    "security": "Implement appropriate authentication and authorization for external resource access",
    "versioning": "Support version control and change tracking for external resources",
    "fallback": "Provide graceful handling when external resources are unavailable",
    "integration": "Design systems to handle various external reference types and protocols"
  }
}
