{
  "table": "0085",
  "name": "Observation result status codes interpretation",
  "description": "Status codes indicating the state and reliability of laboratory and clinical observation results",
  "standard": "hl7v23",
  "version": "2.3",
  "type": "hl7_defined",
  "values": [
    {
      "code": "C",
      "description": "Record coming over is a correction and thus replaces a final result",
      "definition": "Corrected result that supersedes previously reported final results"
    },
    {
      "code": "D",
      "description": "Deletes the OBX record",
      "definition": "Instruction to remove the observation record from the system"
    },
    {
      "code": "F",
      "description": "Final results; Can only be changed with a corrected result.",
      "definition": "Definitive results that have been verified and released for clinical use"
    },
    {
      "code": "I",
      "description": "Specimen in lab; results pending",
      "definition": "Specimen has been received and is being processed, results not yet available"
    },
    {
      "code": "N",
      "description": "Not asked; used to affirmatively document that the observation identified in the OBX was not sought when the universal service ID in OBR-4 implies that it would be sought.",
      "definition": "Explicitly indicates that this observation was not requested despite being part of the ordered service"
    },
    {
      "code": "O",
      "description": "Order detail description only (no result)",
      "definition": "Provides order information without accompanying result values"
    },
    {
      "code": "P",
      "description": "Preliminary results",
      "definition": "Initial results subject to change upon further verification or analysis"
    },
    {
      "code": "R",
      "description": "Results entered -- not verified",
      "definition": "Results have been entered into the system but have not undergone verification process"
    },
    {
      "code": "S",
      "description": "Partial results.   Deprecated. Retained only for backward compatibility as of V2.6.",
      "definition": "Incomplete results, deprecated status maintained for system compatibility"
    },
    {
      "code": "U",
      "description": "Results status change to final without retransmitting results already sent as 'preliminary.'  E.g., radiology changes status from preliminary to final",
      "definition": "Status update from preliminary to final without resending the actual result values"
    },
    {
      "code": "W",
      "description": "Post original as wrong, e.g., transmitted for wrong patient",
      "definition": "Indicates that the originally transmitted result was posted in error"
    },
    {
      "code": "X",
      "description": "Results cannot be obtained for this observation",
      "definition": "Unable to perform or complete the requested observation due to technical or clinical constraints"
    }
  ],
  "usedIn": [
    "OBX.11"
  ],
  "notes": "Critical for result lifecycle management and ensuring appropriate clinical interpretation of observation status"
}