{
  "code": "ADT_A18",
  "name": "Merge patient information",
  "version": "HL7 v2.3",
  "chapter": "Patient Administration",
  "description": "Event A18 is being retained for backward compatibility. \n\nThe A18 event is used to merge current and previous patient identification numbers: PID-3-patient ID ( internal ID), PID-2-patient ID (external ID), PID-4-alternate patient ID-PID, and PID-18-patient account number. This procedure is required, for example, when a previous patient is registered under a new patient identification number because of an error, or because there was insufficient time to determine the actual patient identification number. The merge event occurs when a decision is made to combine the information under either the new or the old identifier(s). We recommend that events A34 (merge patient information-patient ID only), A35 (merge patient information-account number only), A36 (merge patient information-patient ID and account number), A39 (merge person-external ID), A40 (merge patient-internal ID), A41 (merge account-patient account number), and A42 (merge visit-visit number) be utilized in place of the A18 event whenever possible.\n\nThe PID segment contains the surviving patient ID information. The MRG segment contains the nonsurviving information.\n\nThis merge event is non-specific in that, as a result of the merge, several patient identifiers may or may not have changed. For sites requiring (or desiring) greater specificity with regard to this type of message, new events (A34 (merge patient information-patient ID only), A35 (merge patient information-account number only), A36 (merge patient information-patient ID & account number), A39 (merge person-external ID), A40 (merge patient-internal ID), A41 (merge account-patient account number) and A42 (merge visit-visit number)) are now available as alternatives.",
  "segments": [
    {
      "segment_code": "MSH",
      "segment_desc": "Message header segment",
      "optionality": "R",
      "repeatability": "-",
      "is_group": false,
      "group_path": [],
      "level": 0,
      "order_index": 0
    },
    {
      "segment_code": "EVN",
      "segment_desc": "Event type",
      "optionality": "R",
      "repeatability": "-",
      "is_group": false,
      "group_path": [],
      "level": 0,
      "order_index": 1
    },
    {
      "segment_code": "PID",
      "segment_desc": "Patient Identification",
      "optionality": "R",
      "repeatability": "-",
      "is_group": false,
      "group_path": [],
      "level": 0,
      "order_index": 2
    },
    {
      "segment_code": "PD1",
      "segment_desc": "Patient Demographic",
      "optionality": "O",
      "repeatability": "-",
      "is_group": false,
      "group_path": [],
      "level": 0,
      "order_index": 3
    },
    {
      "segment_code": "MRG",
      "segment_desc": "Merge patient information",
      "optionality": "O",
      "repeatability": "-",
      "is_group": false,
      "group_path": [],
      "level": 0,
      "order_index": 4
    },
    {
      "segment_code": "PV1",
      "segment_desc": "Patient visit",
      "optionality": "R",
      "repeatability": "-",
      "is_group": false,
      "group_path": [],
      "level": 0,
      "order_index": 5
    }
  ],
  "segment_count": 6
}