{
  "dataType": "CK",
  "name": "Composite ID with Check Digit",
  "description": "The CK data type is used to represent identification numbers that include an embedded check digit for validation purposes. It combines a unique identifier with a mathematically calculated check digit to detect data entry errors and ensure data integrity. CK is commonly used for patient identifiers, medical record numbers, and other critical healthcare identification numbers where accuracy is essential for patient safety and operational efficiency.",
  "standard": "hl7v23",
  "version": "2.3",
  "category": "composite",
  "components": {
    "CK.1": {
      "name": "ID Number",
      "dataType": "NM",
      "description": "The base identification number without the check digit. This is the core identifier that uniquely identifies the entity within the system.",
      "length": 15,
      "usage": "optional",
      "position": 1
    },
    "CK.2": {
      "name": "Check Digit",
      "dataType": "NM",
      "description": "The mathematically calculated check digit used to validate the ID number. Computed using algorithms such as Luhn, modulus 10, or modulus 11 to detect transcription errors.",
      "length": 1,
      "usage": "optional",
      "position": 2
    },
    "CK.3": {
      "name": "Code Identifying Check Digit Scheme",
      "dataType": "ID",
      "description": "Identifies the specific algorithm or scheme used to calculate the check digit (e.g., M10 for modulus 10, M11 for modulus 11, NPI for National Provider Identifier validation).",
      "length": 3,
      "usage": "optional",
      "position": 3,
      "table": "0061"
    },
    "CK.4": {
      "name": "Assigning Authority",
      "dataType": "HD",
      "description": "The organization or system responsible for assigning and maintaining the identification number. Provides context for the scope and authority of the identifier.",
      "length": 227,
      "usage": "optional",
      "position": 4
    }
  },
  "length": 246,
  "constraints": {
    "encoding": "Components separated by ^ (component separator)",
    "validation": "Check digit must be mathematically valid according to the specified scheme",
    "algorithm": "Check digit scheme must reference a recognized validation algorithm",
    "consistency": "ID number and check digit must form a valid combination"
  },
  "usage": [
    "Patient medical record numbers with validation",
    "Provider identification numbers (NPI, DEA, license numbers)",
    "Insurance member identification numbers",
    "Laboratory specimen identification numbers",
    "Prescription and medication identification numbers",
    "Healthcare facility and organization identifiers",
    "Equipment and device identification numbers"
  ],
  "examples": [
    "123456789^7^M10^University Medical Center",
    "987654321^3^M11^Regional Health System",
    "1234567890^0^NPI^National Provider Registry",
    "555123456^9^M10^City General Hospital",
    "ABC123456^2^LUHN^Metro Health Network",
    "789456123^5^M11^Children's Medical Center"
  ],
  "commonFields": [
    "PID.3 - Patient Identifier List with check digit validation",
    "PID.4 - Alternate Patient ID with validation schemes",
    "Provider identification fields requiring check digit validation",
    "Insurance policy numbers with built-in validation",
    "Laboratory accession numbers with error detection",
    "Medication lot numbers and NDC codes with validation"
  ],
  "generationHints": {
    "typical": "Generate realistic ID numbers with mathematically correct check digits",
    "algorithms": ["M10 (Modulus 10)", "M11 (Modulus 11)", "LUHN", "NPI", "ISO"],
    "idLength": "Use appropriate length for the identifier type (7-15 digits typical)",
    "authorities": ["Hospital systems", "State agencies", "National registries", "Insurance companies"],
    "validation": "Ensure check digit is mathematically correct for the specified algorithm"
  },
  "relatedDataTypes": {
    "CX": "Extended Composite ID with Check Digit - enhanced version with additional components",
    "EI": "Entity Identifier - simpler identifier without check digit validation",
    "HD": "Hierarchic Designator - used for assigning authority component",
    "NM": "Numeric - used for ID number and check digit components",
    "ID": "Coded Value - used for check digit scheme identification"
  },
  "implementationNotes": {
    "validation": "Systems should validate check digits before processing to catch data entry errors",
    "algorithms": "Support common check digit algorithms (Modulus 10, Modulus 11, Luhn)",
    "performance": "Check digit validation adds processing overhead but improves data quality",
    "fallback": "Systems should handle cases where check digit validation fails gracefully",
    "standardization": "Use consistent check digit schemes across the organization for similar identifier types"
  }
}
