{
  "dataType": "CM",
  "name": "Composite",
  "description": "The CM data type is a generic composite data type used in HL7 v2.3 as a placeholder for complex field definitions that were later replaced by more specific composite data types in subsequent HL7 versions. CM fields typically contain multiple related data elements separated by component separators, but the specific structure varies by field and implementation. This data type has been largely superseded by more precisely defined composite types in later HL7 versions.",
  "standard": "hl7v23",
  "version": "2.3",
  "category": "composite",
  "components": {
    "CM.1": {
      "name": "Component 1",
      "dataType": "ST",
      "description": "First component of the composite field. The specific meaning and data type depend on the field where CM is used.",
      "length": 199,
      "usage": "optional",
      "position": 1
    },
    "CM.2": {
      "name": "Component 2",
      "dataType": "ST",
      "description": "Second component of the composite field. Content varies based on specific field implementation.",
      "length": 199,
      "usage": "optional",
      "position": 2
    },
    "CM.3": {
      "name": "Component 3",
      "dataType": "ST",
      "description": "Third component of the composite field. Additional components may be present depending on field requirements.",
      "length": 199,
      "usage": "optional",
      "position": 3
    }
  },
  "length": 597,
  "constraints": {
    "encoding": "Components separated by ^ (component separator)",
    "fieldSpecific": "Actual structure depends on the specific field where CM is used",
    "variableLength": "Number of components varies by implementation and field requirements",
    "deprecated": "CM has been replaced by more specific composite types in later HL7 versions"
  },
  "usage": [
    "Legacy HL7 v2.3 fields requiring composite structure",
    "Backward compatibility with older HL7 implementations",
    "Custom fields where specific composite types are not defined",
    "Vendor-specific extensions requiring multiple data elements",
    "Migration scenarios from earlier HL7 versions"
  ],
  "examples": [
    "VALUE1^VALUE2^VALUE3",
    "DIAGNOSIS^ACUTE^PRIMARY",
    "MEDICATION^DOSAGE^FREQUENCY",
    "LOCATION^BUILDING^ROOM",
    "PROVIDER^DEPARTMENT^SPECIALTY",
    "INSURANCE^POLICY^GROUP"
  ],
  "commonFields": [
    "Legacy fields in older HL7 v2.3 implementations",
    "Custom vendor-specific composite fields",
    "Migration fields during HL7 version upgrades",
    "Backward compatibility implementations",
    "Fields where specific composite types were not yet defined"
  ],
  "generationHints": {
    "typical": "Generate field-appropriate composite values based on context",
    "components": "Use 1-3 components typically, more if field requires",
    "content": "Ensure components are meaningful for the specific field context",
    "legacy": "Consider this a legacy data type for backward compatibility",
    "migration": "Modern implementations should use specific composite types instead"
  },
  "relatedDataTypes": {
    "CE": "Coded Element - more specific replacement for coded CM fields",
    "CX": "Extended Composite ID - replacement for identifier CM fields",
    "XPN": "Extended Person Name - replacement for name CM fields",
    "XAD": "Extended Address - replacement for address CM fields",
    "ST": "String - used for individual CM components"
  },
  "implementationNotes": {
    "legacy": "CM is primarily used for backward compatibility with HL7 v2.3 systems",
    "migration": "New implementations should use more specific composite data types",
    "flexibility": "Provides flexibility for custom composite structures not covered by standard types",
    "parsing": "Parsers must handle variable component counts and field-specific interpretations",
    "deprecation": "Consider migrating CM fields to appropriate specific composite types"
  }
}
